netify-soap/src/test/resources/soap/requests/genre/GetGenreAllRequestNoFilterTest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:gen="http://mouthaan.org/namespace/netify/general">
    <soapenv:Header/>
    <soapenv:Body>
        <gen:GetGenreAllRequest/>
    </soapenv:Body>
</soapenv:Envelope>